[Ability.A_add_ability_setting H7BaseBuff]
mName=""
mTooltip=""

[Ability.A_BurningDetermination H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="时间扭曲"
mTooltip="移除英雄身上所有活跃的法术冷却时间。（除了 %spell2.name）"

[Ability.A_distortion_buff H7BaseBuff]
mName=""
mTooltip=""

[Ability.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="灵魂吸取"
mTooltip="目标生物受到 %buff.buff.d1 %icon_water 水伤害，并为炼金术士恢复 %buff.buff.d1 %icon_health 生命值。\n此外，炼金术士所受伤害的30%会转移给目标。\n效果持续 %buff.buff.durini 回合。如果目标在仍受此技能影响期间死亡，炼金术士可以再次使用此技能。"

[Ability.A_SHIELDING_vodoo H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[Ability.A_Shielding_vodoo_Buff H7BaseBuff]
mName=""
mTooltip=""

[Ability.A_Wait H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔法吸引（等待）"
mTooltip="该生物稍后行动，但为该生物相邻的每个敌人向盟友英雄返还 %buff4.buff.buff.buff.stat %icon_mana 法力值。"

[Ability.A_wait_extra_conf_Buff H7BaseBuff]
mName=""
mTooltip=""

[Ability.A_wait_extra_conf_target_Buff H7BaseBuff]
mName="+5 法力"
mTooltip=""

[Ability.A_water_drain_lien H7BaseBuff]
mName="灵魂吸取"
mTooltip="该生物受到 %d1 %icon_water 水伤害，并承受炼金术士所受伤害的30%，持续 %durnow 回合。"

[Creature.A_Creature_elite_extra_conf H7Creature]
mName="元素炼金术士"
mLore="关于炼金术士的传说有很多。有人说他是一位孤独的时间守护者，维持着善与恶之间的平衡。但没有人知道他真正的起源或命运。\n在魔法师和女巫的隐秘图书馆里，他的故事被写在羊皮纸上，各种组织都在寻找他的踪迹。也许有一天你会在旅途中遇到炼金术士——一个穿梭于世界之间、守护宇宙秘密的存在。"